Zlxwy/Graduation-Design/Code/SCB_STM32F407ZGT6/MyDrivers/UartStream.h
#ifndef __UART_STREAM_H__
#define __UART_STREAM_H__

#include "stm32f4xx_hal.h"
#include "main.h"
#include <string.h>
#include <stdint.h>
#include <stdbool.h>

// # 第1,2个字节
//   - 0x53 0xCA为请求帧帧头
//   - 0x53 0x35为应答帧帧头
//   - 0x53 0x96为事件帧帧头
// # 第3,4,5,6个字节
//   - 有效数据部分长度，大端顺序
// # 在7个字节开始
//   - 有效数据部分
// # 最后2个字节
//   - 从第一个字节开始，到有效数据的最后一个字节，所有字节的CRC16校验码，大端顺序

typedef enum {
  UartStream_FrameHead_1 = 0x53, // 帧头1
  UartStream_FrameHead_2_Req = 0xCA, // 帧头2 请求帧
  UartStream_FrameHead_2_Res = 0x35, // 帧头2 应答帧
  UartStream_FrameHead_2_Evt = 0x96, // 帧头2 事件帧
} UartStream_FrameHead_e;

typedef enum {
  UartStream_ReadStatus_None = 0, // 一点儿数据都没读到，超时了
  UartStream_ReadStatus_CrcErr = 1, // 完整读到了数据，但CRC校验错误
  UartStream_ReadStatus_Timeout = 2, // 读了一部分数据，但中途超时退出了
  UartStream_ReadStatus_Overflow = 3, // 读了一部分数据，但接收缓冲区溢出了
  UartStream_ReadStatus_Successful = 4, // 完整读到了数据，CRC校验也通过了
} UartStream_ReadStatus_e;

#define UART_STREAM_RECV_BUFFER_SIZE  512

typedef struct {
  UART_HandleTypeDef *huart;
  uint8_t RecvBuffer[UART_STREAM_RECV_BUFFER_SIZE];
  uint8_t *RecvPtr; // 接收指针，指向当前接收字节的位置
  uint8_t *ReadPtr; // 读取指针，指向当前读取字节的位置
} UartStream_t;

uint16_t UartStream_CRC16Cal(const uint8_t *bytes, uint32_t len);

void UartStream_Init(UartStream_t *cThis, UART_HandleTypeDef *huart);
void UartStream_FuncCalled_InUartRecvInterrupt(UartStream_t *cThis);
UartStream_ReadStatus_e UartStream_Read(UartStream_t *cThis, uint8_t *FrameData, uint32_t Timeout);

#endif
